In [1]:
import pandas as pd
import numpy as np

In [8]:
data = pd.DataFrame(
    {'Name':['zs','lisi','ww'],
    'Sno':['1001','1002','1003'],
    'Sex':['man','woman','man'],
    'Age':[17,18,19],
    'Score':[80,97,95]},columns=['Sno','Sex','Age','Score'],index=['zs','lisi','ww']
)
data

       Sno    Sex  Age  Score
zs    1001    man   17     80
lisi  1002  woman   18     97
ww    1003    man   19     95

In [10]:
ages = data['Age']
ages.mean(),ages.max(),ages.min(),ages.std()

(18.0, 19, 17, 1.0)

In [14]:
ages.sort_values(ascending=False)

ww      19
lisi    18
zs      17
Name: Age, dtype: int64

In [17]:
scores = data['Score']
scores.mean()

90.66666666666667

In [18]:
scores[scores>scores.mean()]

lisi    97
ww      95
Name: Score, dtype: int64

In [20]:
data[scores>scores.mean()]

       Sno    Sex  Age  Score
lisi  1002  woman   18     97
ww    1003    man   19     95

In [25]:
#只取出三列
data[scores>scores.mean()].loc[:,['Sex','Age','Score']]

        Sex  Age  Score
lisi  woman   18     97
ww      man   19     95

In [32]:
#并且
data[(scores>scores.mean()) & (ages<19)]

       Sno    Sex  Age  Score
lisi  1002  woman   18     97

In [33]:
#或
data[(scores>scores.mean()) | (ages<19)]

       Sno    Sex  Age  Score
zs    1001    man   17     80
lisi  1002  woman   18     97
ww    1003    man   19     95